src/Part1-Julia_R_Python_Install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-05 Thu 21:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>100 Days Of Machine Learning Code</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sergio-Feliciano Mendoza-Barrera" />
<meta name="description" content="Deep Learning Specialization series course"
 />
<meta name="keywords" content="R, data science, emacs, ESS, org-mode, deep learning" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">100 Days Of Machine Learning Code</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7620a66">1. 100DaysOfMLCodeSFMB</a></li>
<li><a href="#org7e22f98">2. Day 1 [Thu Jul  5 20:58:13 CDT 2018]</a>
<ul>
<li><a href="#org31d6032">2.1. Siraj Raval Tweet</a></li>
<li><a href="#org3e6308e">2.2. Challenge</a></li>
<li><a href="#org32ef6ff">2.3. Following my own path using Julia, R and Python</a></li>
<li><a href="#org1a0dfce">2.4. Install Julia</a></li>
<li><a href="#org6c9bce7">2.5. Install python</a></li>
<li><a href="#org449d48e">2.6. Install Emacs</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="ABSTRACT">
<p>
According to the challenge we are going to explore a project and maybe
the possibility to monetize a solution of an industry problem using
ML.
</p>

<p>
<a href="https://twitter.com/sirajraval/status/1014758160572141568">URL</a>
</p>

<p>
"Who’s ready to take the 100 days of ML code challenge? That means
coding machine learning for at least an hour everyday for the next 100
days. Pledge with the #100DaysOfMLCode hashtag, I’ll give the first
few winners a shoutout!"
</p>

</div>

<div id="outline-container-org7620a66" class="outline-2">
<h2 id="org7620a66"><span class="section-number-2">1</span> 100DaysOfMLCodeSFMB</h2>
<div class="outline-text-2" id="text-1">
<p>
After read this tweet can be a great way to master something, do not
know what is, yet.
</p>
</div>
</div>

<div id="outline-container-org7e22f98" class="outline-2">
<h2 id="org7e22f98"><span class="section-number-2">2</span> Day 1 [Thu Jul  5 20:58:13 CDT 2018]</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org31d6032" class="outline-3">
<h3 id="org31d6032"><span class="section-number-3">2.1</span> Siraj Raval Tweet</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Who’s ready to take the 100 days of ML code challenge? That means
coding machine learning for at least an hour everyday for the next 100
days. Pledge with the #100DaysOfMLCode hashtag, I’ll give the first
few winners a shoutout!
</p>

<p>
<a href="https://twitter.com/sirajraval/status/1014758160572141568">Link to Tweet</a>.
</p>
</div>
</div>

<div id="outline-container-org3e6308e" class="outline-3">
<h3 id="org3e6308e"><span class="section-number-3">2.2</span> Challenge</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Pick an industry that sounds exciting, find a problem they have, think
about how AI could be applied to that problem, locate a relevant
dataset, apply AI to the dataset, monetize the solution.
</p>
</div>
</div>

<div id="outline-container-org32ef6ff" class="outline-3">
<h3 id="org32ef6ff"><span class="section-number-3">2.3</span> Following my own path using Julia, R and Python</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In that order, trying to go as far as I can using the first one
syntax.
</p>
</div>
</div>

<div id="outline-container-org1a0dfce" class="outline-3">
<h3 id="org1a0dfce"><span class="section-number-3">2.4</span> Install Julia</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-text">   _       _ _(_)_     |  A fresh approach to technical computing
  (_)     | (_) (_)    |  Documentation: https://docs.julialang.org
   _ _   _| |_  __ _   |  Type "?help" for help.
  | | | | | | |/ _` |  |
  | | |_| | | | (_| |  |  Version 0.6.3 (2018-05-28 20:20 UTC)
 _/ |\__'_|_|_|\__'_|  |  Official http://julialang.org/ release
|__/                   |  x86_64-pc-linux-gnu
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c9bce7" class="outline-3">
<h3 id="org6c9bce7"><span class="section-number-3">2.5</span> Install python</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-text">Python version ::
sys.version_info(major=3, minor=6, micro=5, releaselevel='final', serial=0)
=================
OpenCV version ::
3.4.0
=================
Tensorflow version ::
1.4.1
</pre>
</div>
</div>
</div>

<div id="outline-container-org449d48e" class="outline-3">
<h3 id="org449d48e"><span class="section-number-3">2.6</span> Install Emacs</h3>
<div class="outline-text-3" id="text-2-6">
<p>
I am joking, Emacs is always installed ;-).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 05/07/2018</p>
<p class="author">Author: Sergio-Feliciano Mendoza-Barrera</p>
<p class="date">Created: 2018-07-05 Thu 21:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
